<!DOCTYPE html>
<html lang="es">
  <head>
    <meta charset="utf-8">
	<meta http-equiv="Cache-Control" content="no-cache, no-store, must-revalidate" />
	<meta http-equiv="Pragma" content="no-cache" />
	<meta http-equiv="Expires" content="0" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link rel="icon" href="../images/favicon.png" sizes="32x32">
    <title>IDboxRT documentaci&#243;n</title>

    <!-- CSS de Bootstrap -->
    <link href="../bootstrap.min.css" rel="stylesheet" >
    <link href="../module.css" rel="stylesheet" media="screen">
    <link href="../fonts.css" rel="stylesheet">
    <link href="../themify-icons.css" rel="stylesheet">
    <link href="../idbox_icons.css" rel="stylesheet">
    <link media="screen" href="../site.css" rel="stylesheet" >
    <link href="../fonts/Montserrat.css" rel="stylesheet">
    
    <script language="JavaScript" type="text/javascript" src="../jquery-2.2.4.min.js"></script>
    <script src="../functions.js"></script>
    
   </head>
   
   <body>
		<a id="top" class="show"><div class="arrow"></div></a>

		<div id="portada">  
			<div class="container">
				<div class="cabecera">
		              <div class="logo">
		                      <img src="../images/IDbox_logo.svg">
		              </div>
		              <div class="volver">
		                <a href="../../index.html" class="button"><span>Volver al &#xCD;ndice</span>
		                  <svg width="13px" height="10px" viewBox="0 0 13 10">
		                    <path d="M1,5 L11,5"></path>
		                    <polyline points="8 1 12 5 8 9"></polyline>
		                  </svg>
		                </a>
		                <a href="javascript:history.back()" class="button"><span>Volver atr&aacute;s</span>
		                  <svg width="13px" height="10px" viewBox="0 0 13 10">
		                    <path d="M1,5 L11,5"></path>
		                    <polyline points="8 1 12 5 8 9"></polyline>
		                  </svg>
		                </a>
		              </div>
				</div>
            
            <hr>
            
			<div class="content">
				<div class="titulo-seccion">
  <cite class="icon-id-dashboard"></cite>
  
<h1>DASHBOARDS</h1>
</div>

<p><br /></br> <br /></br></p>
<ul>

<li>1 <a href="#intro">Introducci&#xf3;n</a></li>
<li>2 <a href="#editor">Editor</a>
<ul>

<li>2.1 <a href="#aniadir-elementos">A&#xf1;adir elementos</a></li>
<li>2.2 <a href="#mover-redimensionar">Mover y redimensionar elementos</a></li>
<li>2.3 <a href="#configuracion-elementos">Configuraci&#xf3;n de los elementos</a></li>
<li>2.4 <a href="#tipos-vistas">Tipos de vistas</a></li>
</ul>
</li>
<li>3 <a href="#visor">Visor</a></li>
</ul><section>
<h2><a name="a1._Introducci.C3.B3n"></a><a name="intro"></a>1. Introducci&#xf3;n</h2>
<p>Los dashboards nos permitir&#xe1;n crear cuadros de mando en los que agruparemos el resto de documentos de manera que podamos visualizarles al mismo tiempo en forma tabular.</p>
<p>Se pueden crear desde la secci&#xf3;n de accesos directos. Al pulsar en esta opci&#xf3;n se nos abrir&#xe1; un nuevo dashboard.</p>
<p><img src="images/Imagen11.png" class="grande" alt="Creación de dashboards desde el acceso directo" title="Creación de dashboards desde el acceso directo" /></p><hr /></section><section>
<h2><a name="a2_Editor"></a><a name="editor"></a>2 Editor</h2>
<p>El editor de dashboards consiste en una rejilla que nos permitir&#xe1; a&#xf1;adir elementos a un dashboard, eliminarles o modificarles.</p>
<p>Mediante el bot&#xf3;n guardar <span class="ti-save"></span> de la barra de herramientas podremos guardar el dashboard una vez editado.</p><hr /><section>
<h3><a name="a2.1_A.C3.B1adir_y_eliminar_elementos"></a><a name="aniadir-elementos"></a>2.1 A&#xf1;adir y eliminar elementos</h3>
<p>Para a&#xf1;adir un elemento pulsaremos sobre el bot&#xf3;n de + de dashboards.</p>
<p><img src="images/Imagen211.png" class="grande" alt="Añadir nuevo elemento a un dashboard" title="Añadir nuevo elemento a un dashboard" /></p>
<p>Esto nos agregar&#xe1; un elemento vac&#xed;o a la rejilla del dashboard. En estos elementos podremos asignar visores de documentos o enlaces a los documentos. Como se visualiza cada uno de estos elementos al visor de documento se detalla en la secci&#xf3;n <a href="#visor">visor</a>.</p>
<p>Para a&#xf1;adir un documento espec&#xed;fico al dashboard pulsaremos en el bot&#xf3;n &#x201c;Documento&#x201d; en ese elemento.</p>
<p><img src="images/Imagen212.png" class="grande" alt="Añadir nuevo documento a un dashboard" title="Añadir nuevo elemento a un dashboard" /></p>
<p>Esto nos abrir&#xe1; el selector de documentos para seleccionar el documento que queremos a&#xf1;adir.</p>
<p>Para a&#xf1;adir un enlace a un documento pulsaremos en el bot&#xf3;n &#x201c;Enlace&#x201d;</p>
<p><img src="images/Imagen213.png" class="grande" alt="Añadir nuevo enlace a un dashboard" title="Añadir nuevo enlace a un dashboard" /></p>
<p>Tambi&#xe9;n nos abrir&#xe1; el selector de documentos para seleccionar el documento al cual queremos enlazar.</p>
<p>Para eliminar un elemento del dashboard pulsaremos sobre el aspa del elemento.</p>
<p><img src="images/Imagen214.png" class="grande" alt="Eliminar un elemento de un dashboard" title="Eliminar un elemento de un dashboard" /></p></section><section>
<h3><a name="a2.2_Mover_y_redimensionar_elementos"></a><a name="mover-redimensionar"></a>2.2 Mover y redimensionar elementos</h3>
<p>Podemos pinchar en un elemento y mantener pulsado para arrastrarle a otro lugar de la rejilla. Se indica en un color m&#xe1;s oscuro el lugar donde se posicionar&#xe1; el dashboard en el momento que se suelte el click izquierdo. Adem&#xe1;s si hay otros elementos en el camino, estos se mover&#xe1;n autom&#xe1;ticamente para dejar espacio al nuevo elemento.</p>
<p><img src="images/Imagen221.png" class="grande" alt="Mover un elemento del dashboard" title="Mover un elemento del dashboard" /></p>
<p>Adem&#xe1;s podremos redimensionar un elemento, pulsando y arrastrando desde la esquina inferior derecha del elemento. Al igual que al mover elementos, se nos mostrar&#xe1; en un color oscuro hasta donde redimensionar&#xe1; el elemento y la redimensi&#xf3;n nos mover&#xe1; autom&#xe1;ticamente los elementos que haya en su camino.</p>
<p><img src="images/Imagen222.png" class="grande" alt="Redimensionar un elemento del dashboard" title="Redimensionar un elemento del dashboard" /></p></section><section>
<h3><a name="a2.3_Opciones_de_configuraci.C3.B3n"></a><a name="configuracion-elementos"></a>2.3 Opciones de configuraci&#xf3;n</h3>
<p>Pulsaremos sobre el bot&#xf3;n de configuraci&#xf3;n en un elemento y se nos abrir&#xe1; un panel derecho con las opciones que podemos modificarle.</p>
<p><img src="images/Imagen231.png" class="grande" alt="Configurar elementos del dashboard" title="Configurar elementos del dashboard" /></p>
<p>Las opciones son las siguientes:</p>
<ul>

<li>T&#xed;tulo: Podremos modificar el t&#xed;tulo del elemento, que por defecto ser&#xe1; el del documento al que hace referencia.</li>
<li>Color: Tendremos la opci&#xf3;n de modificar el color del elemento. En el caso de un visor de documentos, nos modificar&#xe1; el color de la cabecera. En el caso de un enlace se modificar&#xe1; el color de todo el elemento.</li>
<li>Mostrar cabecera: Si desmarcamos este checkbox, no se mostrar&#xe1; la cabecera con el t&#xed;tulo del documento. Hay que tener en cuenta que si hacemos esto perderemos el acceso al enlace del documento cuando estemos en el visor, si el elemento es un visor en lugar de un enlace.</li>
<li>Tiempo de refresco: Servir&#xe1; para refrescar el documento autom&#xe1;ticamente. Indicaremos periodo de refresco. Esta opci&#xf3;n s&#xf3;lo est&#xe1; disponible en hist&#xf3;ricos, alarmas y gr&#xe1;ficas (no las de tiempo real, ya que por su naturaleza son refrescadas autom&#xe1;ticamente).</li>
</ul>
<p>Adem&#xe1;s tambi&#xe9;n podremos hacer renombrado r&#xe1;pido de elementos sin necesidad de abrir el panel derecho, simplemente pulsando sobre el t&#xed;tulo del elemento en la propia caja.</p></section><section>
<h3><a name="a2.4_Tipos_de_vistas"></a><a name="tipos-vistas"></a>2.4 Tipos de vistas</h3>
<p>Dado que un dashboard puede preferir verse con distinto tama&#xf1;o o distribuci&#xf3;n en un dispositivo m&#xf3;vil, se definen las siguientes vistas:</p>
<ul>

<li>Vista Web/Tablet: Se refiere a la configuraci&#xf3;n que tendr&#xe1; el dashboard para su visualizaci&#xf3;n en la web o en una tablet que tenga la aplicaci&#xf3;n m&#xf3;vil de IDbox.</li>
<li>Vista M&#xf3;vil: Visualizaci&#xf3;n que tendr&#xe1; el dashboard en un smartphone que tenga la aplicaci&#xf3;n m&#xf3;vil de IDbox.</li>
</ul>
<p>Si pulsamos en el desplegable de tipos de vistas, veremos estas opciones:</p>
<p><img src="images/Imagen241.png" class="grande" alt="Tipos de vistas" title="Tipos de vistas" /></p>
<p>Los dashboard tanto en m&#xf3;vil como en web tendr&#xe1;n los mismos elementos. Para la vista m&#xf3;vil, la ventana ser&#xe1; m&#xe1;s peque&#xf1;a, como si fuese un dispositivo m&#xf3;vil:</p>
<p><img src="images/Imagen242.png" class="grande" alt="Vista móvil" title="Vista móvil" /></p></section></section><section>
<h2><a name="a3_Visor"></a><a name="visor"></a> 3 Visor</h2>
<p>A la hora de abrir un documento de tipo dashboard o pulsar en el bot&#xf3;n de &#x201c;Vista Previa&#x201d; <span class="ti-control-play"></span> de la barra de herramientas del editor. Visualizaremos el dashboard en modo visor, con los elementos que hayamos puesto y su configuraci&#xf3;n.</p>
<p><img src="images/Imagen31.png" class="grande" alt="Visor Dashboard" title="Visor dashboard" /></p>
<p>Cabe destacar como se visualizar&#xe1;n los diferentes tipos de elementos que puede tener el dashboard:</p>
<ul>

<li>Los elementos de dashboard vac&#xed;os se visualizar&#xe1;n con un hueco como si no hubiese elemento.</li>
<li>Los elementos de tipo documento visualizar&#xe1;n el visor del documento en la regi&#xf3;n especificada.</li>
<li>Los documentos de tipo enlace nos crear&#xe1;n un bot&#xf3;n que al pinchar en &#xe9;l nos abrir&#xe1; el documento.</li>
</ul></section>

			</div>
		</div>
    
		<div id="myModal" class="modal">
  			<span class="close" onclick="document.getElementById('myModal').style.display='none'">&times;</span>
  			<img class="modal-content" id="img01">
  		<div id="caption"></div>
	</div>

		<script>
			// Get the modal
			var modal = document.getElementById('myModal');
			
			var modalImg = document.getElementById("img01");
			var captionText = document.getElementById("caption");
	
			// buscamos todas las imagenes
			var imgs = document.getElementsByTagName('img');
			for(var i = 0; i < imgs.length;i++)
			{
				  // por cada imagen le asignamos el evento clic que mostrara la imagen en la modal
				  var img = imgs[i];
				  img.onclick = function()
				  {
				      modal.style.display = "block";
				      modalImg.src = this.src;
				      captionText.innerHTML = this.alt;
				  }
			}
	
	
	 
			var span = document.getElementsByClassName("close")[0];
			 
			 
			span.onclick = function() 
			{
			  	modal.style.display = "none";
			}
		
		</script>

  </body>

   <footer>
   
        <div class="container">

            <hr class="detalle">
            <div class="row">
                <div class="col-md-12 footer">
                    <div class="datos">
                        <p>DOCUMENTACI&Oacute;N</p>
                        <p>Versi&#243;n 3.0</p>
                    </div>

                    <div class="copy">
                        <p>&copy;IDboxRT a CIC CONSULTING INFORM&Aacute;TICO Product</p>
                    </div>
                </div>
            </div>
        </div>
   </footer>