<!DOCTYPE html>
<html lang="es">
  <head>
    <meta charset="utf-8">
	<meta http-equiv="Cache-Control" content="no-cache, no-store, must-revalidate" />
	<meta http-equiv="Pragma" content="no-cache" />
	<meta http-equiv="Expires" content="0" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link rel="icon" href="../images/favicon.png" sizes="32x32">
    <title>IDboxRT documentaci&#243;n</title>

    <!-- CSS de Bootstrap -->
    <link href="../bootstrap.min.css" rel="stylesheet" >
    <link href="../module.css" rel="stylesheet" media="screen">
    <link href="../fonts.css" rel="stylesheet">
    <link href="../themify-icons.css" rel="stylesheet">
    <link href="../idbox_icons.css" rel="stylesheet">
    <link media="screen" href="../site.css" rel="stylesheet" >
    <link href="../fonts/Montserrat.css" rel="stylesheet">
    
    <script language="JavaScript" type="text/javascript" src="../jquery-2.2.4.min.js"></script>
    <script src="../functions.js"></script>
    
   </head>
   
   <body>
		<a id="top" class="show"><div class="arrow"></div></a>

		<div id="portada">  
			<div class="container">
				<div class="cabecera">
		              <div class="logo">
		                      <img src="../images/IDbox_logo.svg">
		              </div>
		              <div class="volver">
		                <a href="../../index.html" class="button"><span>Volver al &#xCD;ndice</span>
		                  <svg width="13px" height="10px" viewBox="0 0 13 10">
		                    <path d="M1,5 L11,5"></path>
		                    <polyline points="8 1 12 5 8 9"></polyline>
		                  </svg>
		                </a>
		                <a href="javascript:history.back()" class="button"><span>Volver atr&aacute;s</span>
		                  <svg width="13px" height="10px" viewBox="0 0 13 10">
		                    <path d="M1,5 L11,5"></path>
		                    <polyline points="8 1 12 5 8 9"></polyline>
		                  </svg>
		                </a>
		              </div>
				</div>
            
            <hr>
            
			<div class="content">
				<div class="titulo-seccion">
  <cite class="ti-signal"></cite>
  
<h1>SE&#xd1;ALES</h1>
</div>

<p><br /></br> <br /></br></p>
<ul>

<li>1 <a href="#intro">Introducci&#xf3;n</a></li>
<li>2 <a href="#seniales">Se&#xf1;ales</a></li>
<li>3 <a href="#grupos-seniales">Grupos de Se&#xf1;ales</a></li>
<li>3 <a href="#campos-adicionales">Campos adicionales</a></li>
<li>4 <a href="#funciones">Funciones</a></li>
<li>5 <a href="#unidades">Unidades</a></li>
<li>6 <a href="#categorias">Categor&#xed;as</a></li>
</ul><section>
<h2><a name="a1._Introducci.C3.B3n"></a><a name="intro"></a>1. Introducci&#xf3;n</h2>
<p>En esta secci&#xf3;n especificaremos como se puede realizar la administraci&#xf3;n de se&#xf1;ales.</p>
<p>A continuaci&#xf3;n se pasa a definir cada uno de los apartados que componen la administraci&#xf3;n de se&#xf1;ales</p><hr /></section><section>
<h2><a name="a2_Se.C3.B1ales"></a><a name="seniales"></a>2 Se&#xf1;ales</h2><section>
<h3><a name="a2.1_Gesti.C3.B3n"></a><a name="signal-crud"></a>2.1 Gesti&#xf3;n</h3>
<p>Desde el panel de control podremos acceder, a la secci&#xf3;n de &#x201c;Se&#xf1;ales&#x201d;.</p>
<p><img src="images/Imagen21.png" class="grande" alt="Sección de señales" title="Sección de señales" /></p>
<p>Esto nos permitir&#xe1; listar todas las se&#xf1;ales que tengamos disponibles o buscar alguna en concreto mediante el buscador.</p>
<p><img src="images/Imagen22.png" class="grande" alt="Listado de señales" title="Listado de señales" /></p>
<p>El bot&#xf3;n de a&#xf1;adir <span class="ti-plus"></span> nos permitir&#xe1; dar de alta nuevas se&#xf1;ales en el sistema. Si seleccionamos una se&#xf1;al podremos editarla mediante el bot&#xf3;n de <span class="ti-pencil-alt"></span> o borrarla mediante <span class="ti-trash"></span>. Adem&#xe1;s podremos asociar r&#xe1;pidamente se&#xf1;ales a un grupo de se&#xf1;ales con el bot&#xf3;n <span class="icon-id-signalgroups"></span> marcando una o varias se&#xf1;ales al mismo tiempo.</p>
<p>Por otro lado, el bot&#xf3;n <span class="icon-id-d-template"></span> permite exportar un documento Excel en dos modalidades: con los datos de las se&#xf1;ales seleccionadas o una plantilla base, que en ambos casos puede ser importado posteriormente al sistema mediante el bot&#xf3;n <span class="icon-id-import"></span> para realizar as&#xed; altas, modificaciones masivas de se&#xf1;ales o ambas.</p>
<p>Si a&#xf1;adimos o editamos a una se&#xf1;al nos abrir&#xe1; una ventana para modificar sus datos.</p>
<p><img src="images/Imagen23.png" class="grande" alt="Edición de una señal" title="Edición de una señal" /></p>
<p>Aqu&#xed; se explican los campos de esta secci&#xf3;n:</p>
<ul>

<li>Identificador: El identificador de la se&#xf1;al, asignado autom&#xe1;ticamente por el sistema.</li>
<li>Se&#xf1;al: El nombre de la se&#xf1;al.</li>
<li>Descripci&#xf3;n: Descripci&#xf3;n de la se&#xf1;al.</li>
<li>Origen: Informaci&#xf3;n acerca del origen de datos de la se&#xf1;al.</li>
<li>Zona Horaria: Nos permitir&#xe1; cambiar la zona horaria a la que pertenezca la se&#xf1;al.</li>
<li>Tipo estad&#xed;stico: Nos permitir&#xe1; seleccionar si el estad&#xed;stico de la se&#xf1;al es &#x201c;Aritm&#xe9;tico&#x201d; o &#x201c;Ponderado en el tiempo&#x201d;.</li>
<li>Calculada: Indica si la se&#xf1;al es calculada o no.</li>
<li>Activo: Si est&#xe1; marcado, indicar&#xe1; que la se&#xf1;al est&#xe1; activa en el sistema.</li>
<li>Grupos de se&#xf1;ales: Los grupos de se&#xf1;ales a los cuales pertenece la se&#xf1;al. Si lo pulsamos nos abrir&#xe1; un selector seleccionarles.</li>
<li>Tipo: Indica si la se&#xf1;al es &#x201c;Anal&#xf3;gica&#x201d;, &#x201c;Digital&#x201d; de tipo &#x201c;Texto&#x201d; o &#x201c;Discreta&#x201d;.</li>
</ul>
<p>En caso de que una se&#xf1;al sea anal&#xf3;gica adem&#xe1;s veremos los siguientes campos:</p>
<ul>

<li>Valor m&#xed;nimo: Valor m&#xed;nimo de la se&#xf1;al.</li>
<li>Valor m&#xe1;ximo: Valor m&#xe1;ximo de la se&#xf1;al.</li>
<li>Unidades: Combo que contiene tipos de unidades posibles para asignar a la se&#xf1;al.</li>
<li>Notaci&#xf3;n: Si sus valores se representar&#xe1;n en notaci&#xf3;n &#x201c;Decimal&#x201d; o &#x201c;Cient&#xed;fica&#x201d;.</li>
<li>N&#xfa;mero de decimales: Indica con cu&#xe1;ntos decimales se representar&#xe1; la se&#xf1;al.</li>
</ul>
<p>En el caso de una se&#xf1;al digital podremos establecer:</p>
<ul>

<li>Valor verdadero: Texto que representa que la se&#xf1;al tenga valor verdadero.</li>
<li>Valor falso: Texto que representa que la se&#xf1;al tenga valor falso.</li>
</ul>
<p>Por &#xfa;ltimo en caso de las discretas podemos seleccionar una categor&#xed;a.</p>
<p>En el &#xfa;ltimo grid veremos la configuraci&#xf3;n de las alarmas.</p>
<p>S&#xf3;lo en el caso de que hayamos entrado a editar la se&#xf1;al desde la secci&#xf3;n <a href="adquire/adquire.html#service-edition-catalog">edici&#xf3;n cat&#xe1;logo desde el configurador de servicios</a></p>
<p><img src="images/Imagen24.png" class="grande" alt="Edición de alarmas" title="Edición de alarmas" /></p>
<p>Los campos de configuraci&#xf3;n de una alarma son los siguientes:</p>
<ul>

<li>Tipo: Tipo de alarma que se va a controlar. Los valores posibles son &#x201c;Valor&#x201d;, &#x201c;Alta&#x201d;, &#x201c;Baja&#x201d; y &#x201c;Estado&#x201d;:</li>
</ul>
<p>*Valor: Si el valor de la arma es exactamente el valor que especifiquemos en el campo &#x201c;Valor&#x201d;, se disparar&#xe1;. *Alta: Si el valor de la alarma supera el umbral del campo &#x201c;Valor&#x201d;, se disparar&#xe1; la alarma. *Baja: En el momento que el valor de la alrma sea inferior a el campo &#x201c;Valor&#x201d;, se disparar&#xe1;. *Estado: Si la alarma pasa a tener el estado especificado en el campo &#x201c;Valor&#x201d;, se disparar&#xe1;.</p>
<ul>

<li>Valor: Campo que variar&#xe1; en funci&#xf3;n del tipo. Ser&#xe1; un n&#xfa;mero si el tipo es &#x201c;Valor&#x201d;, &#x201c;Alta&#x201d; o &#x201c;Baja&#x201d; y uno o varios estados si es de tipo &#x201c;Estado&#x201d;.</li>
<li>Estado: Estado que tendr&#xe1; la alarma al emitirse.</li>
<li>Descripci&#xf3;n activaci&#xf3;n: Mensaje que se le da a alarma cuando se active.</li>
<li>Severidad activaci&#xf3;n: Severidad correspondiente a la alarma que se activa. Los valores posibles son &#x201c;Trivial&#x201d;, &#x201c;Baja&#x201d;, &#x201c;Media&#x201d;, &#x201c;Alta&#x201d; o &#x201c;Cr&#xed;tica&#x201d;.</li>
<li>Refresco activaci&#xf3;n: Tiempo, en segundos. Si desde que la alarma se activ&#xf3;, pasa este tiempo con ella activa, se volver&#xe1; a pedir el reconocimiento de la misma.</li>
<li>Descripci&#xf3;n desactivaci&#xf3;n: Descripci&#xf3;n que se dar&#xe1; cuando la alarma se desactive.</li>
<li>Severidad desactivaci&#xf3;n: Severidad correspondiente a la alarma cuando se desactive. Los valores posibles son &#x201c;Trivial&#x201d;, &#x201c;Baja&#x201d;, &#x201c;Media&#x201d;, &#x201c;Alta&#x201d; o &#x201c;Cr&#xed;tica&#x201d;.</li>
<li>Banda muerta: Margen diferencial para recuperar el valor de alarma.</li>
<li>Demora: Tiempo que tiene que cumplir la alarma para que realmente se dispare.</li>
<li>Se&#xf1;al de omisi&#xf3;n: En este campo se indica la se&#xf1;al digital que omitir&#xed;a esa alarma cuando su valor sea verdadero.</li>
<li>Estados de planta: Estados del sistema en los cuales se aplicar&#xed;a la definici&#xf3;n de alarma.</li>
</ul>
<p>Para guardar la se&#xf1;al en su totalidad, pulsaremos en el bot&#xf3;n de &#x201c;Aceptar&#x201d;.</p></section><section>
<h3><a name="a2.2_Informaci.C3.B3n"></a><a name="signal-informatiom"></a>2.2 Informaci&#xf3;n</h3>
<p>Los campos anteriormente mostrados en el plano de la configuraci&#xf3;n se encuentran tambi&#xe9;n disponibles para su visualizaci&#xf3;n, junto con m&#xe1;s detalles, a trav&#xe9;s de la pesta&#xf1;a de informaci&#xf3;n de se&#xf1;al. Su apertura puede realizarse mediante el icono de informaci&#xf3;n <span class="ti-info"></span> que se sit&#xfa;a a continuaci&#xf3;n de la se&#xf1;al como muestra en el siguiente ejemplo de la vista principal del explorador.</p>
<p><img src="images/signal-info-explorer.png" class="mediano" alt="Apertura de la información de señal desde el explorador" title="Apertura de la información de señal desde el explorador" /></p>
<p>Una vez abierta, y como se puede observar en la siguiente imagen, la pesta&#xf1;a de informaci&#xf3;n se divide en varios apartados navegables mediante el men&#xfa; situado en el lateral izquierdo as&#xed; como un resumen de su nombre, descripci&#xf3;n, tipo y acceso directo a la edici&#xf3;n en la parte superior.</p>
<p><img src="images/signal-info-tab.png" class="grande" alt="Pestaña de información de señal" title="Pestaña de información de señal" /></p>
<p>Dependiendo del tipo de se&#xf1;al se mostrar&#xe1;n disponibles distintas opciones en funci&#xf3;n de sus caracter&#xed;sticas. En el siguiente listado se describen cada una de ellas.</p>
<ul>

<li><b>Detalles</b>: muestra las propiedades y caracter&#xed;sticas, grupos a los que pertenece, campos adicionales y alarmas configuradas.</li>
<li><b>Documentos</b>: lista de documentos clasificados por su tipo, seg&#xfa;n los permisos y grupo de seguridad del usuario, en los que se est&#xe1; utilizando la se&#xf1;al consultada.</li>
<li><b>An&#xe1;lisis</b>: se visualiza el resultado de la aplicaci&#xf3;n de diferentes t&#xe9;cnicas de an&#xe1;lisis sobre los datos para obtener informaci&#xf3;n sobre el comportamiento de la se&#xf1;al a lo largo del tiempo.</li>
<li>

<p>El an&#xe1;lisis de <b>estad&#xed;sticos</b> se encuentra disponible para las se&#xf1;ales anal&#xf3;gicas, digitales y discretas. El valor surge de la aplicaci&#xf3;n de distintas funciones sobre los datos que permiten conocer informaci&#xf3;n sobre c&#xf3;mo se comporta el hist&#xf3;rico. La cantidad de estad&#xed;sticos disponibles var&#xed;a en funci&#xf3;n del tipo de la se&#xf1;al sobre los que se calculan.</p>
</li>
<li>

<p>La gr&#xe1;fica de <b>distribuci&#xf3;n de los datos</b> muestra c&#xf3;mo se organizan los valores de la se&#xf1;al seg&#xfa;n el n&#xfa;mero de observaciones para el periodo de tiempo seleccionado. La cantidad de datos utilizados para la representaci&#xf3;n se trata de una muestra resumida mediante marca.</p>
</li>
</ul>
<p><img src="images/signal-info-analysis.png" class="grande" alt="Análisis de señal" title="Análisis de señal" /></p><hr /></section></section><section>
<h2><a name="a3_Grupos_de_Se.C3.B1ales"></a><a name="grupos-seniales"></a>3 Grupos de Se&#xf1;ales</h2>
<p>En esta secci&#xf3;n podremos gestionar los grupos de se&#xf1;ales que existen en el sistema. Podemos acceder a ella desde el panel de control:</p>
<p><img src="images/Imagen31.png" class="grande" alt="Sección de grupos de señales" title="Sección de grupos de señales" /></p>
<p>Esto nos llevar&#xe1; a un grid con los grupos de se&#xf1;ales dados de alta. Mediante el buscador podremos filtrar alg&#xfa;n grupo de se&#xf1;ales.</p>
<p><img src="images/Imagen32.png" class="grande" alt="Listado de grupos de señales" title="Listado de grupos de señales" /></p>
<p>A&#xf1;adiremos un nuevo grupo de se&#xf1;ales mediante el bot&#xf3;nde a&#xf1;adir <span class="ti-plus"></span>. Si seleccionamos un grupo concreto se nos habilitar&#xe1;n las opciones de editarle <span class="ti-pencil-alt"></span> o eliminarle <span class="ti-trash"></span>.</p>
<p>Al a&#xf1;adir o editar entraremos en la secci&#xf3;n de edici&#xf3;n de un grupo de se&#xf1;ales.</p>
<p><img src="images/Imagen33.png" class="grande" alt="Edición de un grupo de señales" title="Edición de un grupo de señales" /></p>
<p>En esta pantalla podremos editar las siguientes propiedades:</p>
<ul>

<li>Nombre: Nombre con el que visualizaremos el grupo de se&#xf1;ales.</li>
<li>Descripci&#xf3;n: Descripci&#xf3;n de el grupo de se&#xf1;ales.</li>
<li>Grupos de seguridad: Seleccionaremos un grupo de seguridad existente en el cual ir&#xe1; el grupo de se&#xf1;ales. No es posible modificarle una vez el grupo ya est&#xe9; creado.</li>
<li>Grupos de acceso: Indicar&#xe1;n los grupos de acceso que podr&#xe1;n visualizar este grupo de se&#xf1;ales.</li>
<li>Grupo de se&#xf1;ales padre: Listar&#xe1; el resto de grupos de se&#xf1;ales dentro del grupo de seguridad seleccionado para que podamos seleccionar cual ser&#xe1; su padre en la jerarqu&#xed;a de grupos de se&#xf1;ales.</li>
<li>Se&#xf1;ales en grupo: Grid que nos mostrar&#xe1; las se&#xf1;ales que est&#xe1;n en este grupo de se&#xf1;ales. Podremos a&#xf1;adirlas mediante <span class="ti-plus"></span> o quitarlas del grupo mediante <span class="ti-trash"></span>.</li>
</ul>
<p>Para guardar el grupo de se&#xf1;ales pulsaremos en el bot&#xf3;n de <span class="ti-save"></span> de la barra de herramientas.</p><hr /></section><section>
<h2><a name="a3_Campos_adicionales"></a><a name="campos-adicionales"></a>3 Campos adicionales</h2>
<p>En esta secci&#xf3;n podremos gestionar campos adicionales de las se&#xf1;ales que existen en el sistema. Podemos acceder a ella desde el panel de control:</p>
<p><img src="images/Imagen34.png" class="grande" alt="Sección de campos adicionales" title="Sección de campos adicionales" /></p>
<p>Esto nos llevar&#xe1; a a la ventana de gesti&#xf3;n de campos adicionales, en la parte izquierda podremos seleccionar el grupo de seguridad del cual deseamos ver los campos adicionales o marcar que deseamos ver todos los campos adicionales del sistema.</p>
<blockquote>

<p>Nota: si seleccionamos &#x201c;Mostrar todos los campos adicionales del sistema&#x201d; no podremos a&#xf1;adir un nuevo campo adicional.</p>
</blockquote>
<p><img src="images/Imagen37.png" class="grande" alt="Listado de campos adicionales" title="Listado de campos adicionales" /></p>
<p>A&#xf1;adiremos un nuevo campo adicional mediante el bot&#xf3;n de a&#xf1;adir <span class="ti-plus"></span>. Si seleccionamos un campo adicional se nos habilitar&#xe1;n las opciones de editarle <span class="ti-pencil-alt"></span> o eliminarle <span class="ti-trash"></span>.</p>
<p>Al a&#xf1;adir un nuevo campo adicional simplemente se a&#xf1;adir&#xe1; una nueva fila a la tabla de campos adicionales en la cual deberemos indicar el nombre que deseamos dar al nuevo campo adicional.</p>
<p><img src="images/Imagen36.png" class="grande" alt="Alta campo adicional" title="Creación campo adicional" /></p><hr /></section><section>
<h2><a name="a4_Funciones"></a><a name="funciones"></a>4 Funciones</h2>
<p>En esta secci&#xf3;n podremos gestionar las funciones que existen en el sistema. Podemos acceder a ella desde el panel de control:</p>
<p><img src="images/Imagen38.png" class="grande" alt="Sección de funciones" title="Sección de funciones" /></p>
<p>Esto nos llevar&#xe1; a un grid con las funciones dados de alta. Mediante el buscador podremos filtrar las funciones.</p>
<p><img src="images/Imagen39.png" class="grande" alt="Listado de funciones" title="Listado de funciones" /></p>
<p>A&#xf1;adiremos una nueva funci&#xf3;n mediante el bot&#xf3;n de a&#xf1;adir <span class="ti-plus"></span>. Si seleccionamos una funci&#xf3;n se nos habilitar&#xe1;n las opciones de edici&#xf3;n <span class="ti-pencil-alt"></span> y borrado <span class="ti-trash"></span>.</p>
<p>Al a&#xf1;adir o editar se abrir&#xe1; la secci&#xf3;n de edici&#xf3;n de una funci&#xf3;n.</p>
<p><img src="images/Imagen40.png" class="grande" alt="Edición de una función" title="Edición de una función" /></p>
<p>En esta pantalla podremos editar las siguientes propiedades:</p>
<ul>

<li>Nombre: Nombre con el que visualizaremos la funci&#xf3;n.</li>
<li>Descripci&#xf3;n: Descripci&#xf3;n de la funci&#xf3;n.</li>
<li>Ecuaci&#xf3;n: Podremos a&#xf1;adir una se&#xf1;al que se mostrar&#xe1; como hist&#xf3;rico en la ecuaci&#xf3;n u operadores que se encuentran en los desplegables de la parte inferior.</li>
</ul>
<p>Para guardar la funci&#xf3;n pulsaremos en el bot&#xf3;n de <span class="ti-save"></span> de la barra de herramientas.</p><hr /></section><section>
<h2><a name="a5_Unidades"></a><a name="unidades"></a>5 Unidades</h2>
<p>En esta secci&#xf3;n podremos gestionar las unidades que existen en el sistema. Podemos acceder a ella desde el panel de control:</p>
<p><img src="images/Imagen41.png" class="grande" alt="Sección de unidades" title="Sección de unidades" /></p>
<p>Esto nos llevar&#xe1; a un grid con las unidades dadas de alta. Mediante el buscador podremos filtrar las unidades.</p>
<p><img src="images/Imagen42.png" class="grande" alt="Listado de unidades" title="Listado de unidades" /></p>
<p>A&#xf1;adiremos una nueva unidad mediante el bot&#xf3;n de a&#xf1;adir <span class="ti-plus"></span>. Si seleccionamos una unidad se nos habilitar&#xe1;n las opciones de edici&#xf3;n <span class="ti-pencil-alt"></span> y borrado <span class="ti-trash"></span>.</p>
<p>Al a&#xf1;adir o editar se abrir&#xe1; la secci&#xf3;n de edici&#xf3;n de una unidad.</p>
<p><img src="images/Imagen43.png" class="grande" alt="Edición de una unidad" title="Edición de una unidad" /></p>
<p>En esta pantalla podremos editar las siguientes propiedades:</p>
<ul>

<li>S&#xed;mbolo: Es el s&#xed;mbolo usado para expresar la unidad.</li>
<li>Unidad padre: Es la unidad de la que depender&#xe1; la unidad en creaci&#xf3;n/edici&#xf3;n(Opcional).</li>
<li>Medida: Es el tipo de medida, si tiene unidad padre tendr&#xe1; la medida del padre.</li>
<li>Slope: Es el valor por el que hay que multiplicar la unidad actual para obtener la unidad padre</li>
<li>yIntercept: En caso de que la unidad padre y la actual no coincidan en el valo cero, se establece la diferencia entre ambas. Por ejemplo grados celsius tendr&#xed;a yIntercept = -273.15, ya que el 0 de la unidad padre (grados Kelvin) equivale a -273.15&#xb0;C</li>
</ul>
<p>Para guardar la unidad pulsaremos en el bot&#xf3;n de <span class="ti-save"></span> de la barra de herramientas.</p><hr /></section><section>
<h2><a name="a6_Categor.C3.ADas"></a><a name="categorias"></a>6 Categor&#xed;as</h2>
<p>En esta secci&#xf3;n podremos gestionar las categor&#xed;as que existen en el sistema. Podemos acceder a ella desde el panel de control:</p>
<p><img src="images/Imagen44.png" class="grande" alt="Sección de categorías" title="Sección de categorías" /></p>
<p>Esto nos llevar&#xe1; a un grid con las categor&#xed;as dadas de alta. Mediante el buscador podremos filtrar las categor&#xed;as.</p>
<p><img src="images/Imagen45.png" class="grande" alt="Listado de categorías" title="Listado de categorías" /></p>
<p>En la parte izquierda encontraremos el listado de categor&#xed;as con sus botones para a&#xf1;adir <span class="ti-plus"></span>, editar <span class="ti-pencil-alt"></span> y eliminar <span class="ti-trash"></span>.</p>
<p>Si existen categor&#xed;as, por defecto la primera se seleccionar&#xe1; al acceder a esta pantalla, lo que har&#xe1; que en la parte derecha de la pantalla se muestre el grid con los valores de esa categor&#xed;a.</p>
<p><img src="images/Imagen46.png" class="grande" alt="Listado de valores de categorías" title="Listado de valores de categorías" /></p>
<p>Si seleccionamos el valor de una categor&#xed;a se nos habilitar&#xe1;n las opciones de edici&#xf3;n <span class="ti-pencil-alt"></span> y borrado <span class="ti-trash"></span>.</p>
<p>En esta pantalla las acciones de editar y a&#xf1;adir se realizar&#xe1;n dentro del mismo grid sin necesidad de acceder a una nueva pantalla, una vez consideres que has terminado la edici&#xf3;n/a&#xf1;adido de valores deber&#xe1;s usar el bot&#xf3;n de guardar que aparece al editar/a&#xf1;adir.</p>
<p><img src="images/Imagen47.png" class="grande" alt="Edición de un valor de categoría" title="Edición de un valor de categoría" /></p>
<p>En este grid se podr&#xe1;n editar: * Valor Categ&#xf3;rico: Texto usado para representar el valor. * Valor Num&#xe9;rico: Clave num&#xe9;rica que identifica el valor.</p></section>

			</div>
		</div>
    
		<div id="myModal" class="modal">
  			<span class="close" onclick="document.getElementById('myModal').style.display='none'">&times;</span>
  			<img class="modal-content" id="img01">
  		<div id="caption"></div>
	</div>

		<script>
			// Get the modal
			var modal = document.getElementById('myModal');
			
			var modalImg = document.getElementById("img01");
			var captionText = document.getElementById("caption");
	
			// buscamos todas las imagenes
			var imgs = document.getElementsByTagName('img');
			for(var i = 0; i < imgs.length;i++)
			{
				  // por cada imagen le asignamos el evento clic que mostrara la imagen en la modal
				  var img = imgs[i];
				  img.onclick = function()
				  {
				      modal.style.display = "block";
				      modalImg.src = this.src;
				      captionText.innerHTML = this.alt;
				  }
			}
	
	
	 
			var span = document.getElementsByClassName("close")[0];
			 
			 
			span.onclick = function() 
			{
			  	modal.style.display = "none";
			}
		
		</script>

  </body>

   <footer>
   
        <div class="container">

            <hr class="detalle">
            <div class="row">
                <div class="col-md-12 footer">
                    <div class="datos">
                        <p>DOCUMENTACI&Oacute;N</p>
                        <p>Versi&#243;n 3.0</p>
                    </div>

                    <div class="copy">
                        <p>&copy;IDboxRT a CIC CONSULTING INFORM&Aacute;TICO Product</p>
                    </div>
                </div>
            </div>
        </div>
   </footer>