<!DOCTYPE html>
<html lang="es">
  <head>
    <meta charset="utf-8">
	<meta http-equiv="Cache-Control" content="no-cache, no-store, must-revalidate" />
	<meta http-equiv="Pragma" content="no-cache" />
	<meta http-equiv="Expires" content="0" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link rel="icon" href="../images/favicon.png" sizes="32x32">
    <title>IDboxRT documentaci&#243;n</title>

    <!-- CSS de Bootstrap -->
    <link href="../bootstrap.min.css" rel="stylesheet" >
    <link href="../module.css" rel="stylesheet" media="screen">
    <link href="../fonts.css" rel="stylesheet">
    <link href="../themify-icons.css" rel="stylesheet">
    <link href="../idbox_icons.css" rel="stylesheet">
    <link media="screen" href="../site.css" rel="stylesheet" >
    <link href="../fonts/Montserrat.css" rel="stylesheet">
    
    <script language="JavaScript" type="text/javascript" src="../jquery-2.2.4.min.js"></script>
    <script src="../functions.js"></script>
    
   </head>
   
   <body>
		<a id="top" class="show"><div class="arrow"></div></a>

		<div id="portada">  
			<div class="container">
				<div class="cabecera">
		              <div class="logo">
		                      <img src="../images/IDbox_logo.svg">
		              </div>
		              <div class="volver">
		                <a href="../../index.html" class="button"><span>Volver al &#xCD;ndice</span>
		                  <svg width="13px" height="10px" viewBox="0 0 13 10">
		                    <path d="M1,5 L11,5"></path>
		                    <polyline points="8 1 12 5 8 9"></polyline>
		                  </svg>
		                </a>
		                <a href="javascript:history.back()" class="button"><span>Volver atr&aacute;s</span>
		                  <svg width="13px" height="10px" viewBox="0 0 13 10">
		                    <path d="M1,5 L11,5"></path>
		                    <polyline points="8 1 12 5 8 9"></polyline>
		                  </svg>
		                </a>
		              </div>
				</div>
            
            <hr>
            
			<div class="content">
				<div class="titulo-seccion">
<cite class="ti-notepad"></cite>
<h1>Informes</h1>
</div>

<ul>

<li>1 <a href="#intro">Introducci&#xf3;n</a></li>
<li>2 <a href="#report-creation">Creaci&#xf3;n de informes</a>
<ul>

<li>2.1 <a href="#report-creation-init">Configuraci&#xf3;n inicial</a>
<ul>

<li>2.1.1 <a href="#report-creation-init-quickstart">Comienzo r&#xe1;pido</a></li>
<li>2.1.2 <a href="#report-creation-init-wizard">Asistente de personalizaci&#xf3;n</a></li>
</ul>
</li>
<li>2.2 <a href="#report-creation-save">Guardado de documento</a></li>
</ul>
</li>
<li>3 <a href="#report-viewer">Visualizaci&#xf3;n de informes</a></li>
<li>4 <a href="#report-designer">Dise&#xf1;o de informes</a></li>
</ul><section>
<h2><a name="a1._Introducci.C3.B3n"></a><a name="intro"></a>1. Introducci&#xf3;n</h2>
<p>Los informes permiten generar visualizaciones personalizadas sobre eventos o hechos ocurridos en un conjunto de datos determinado sobre un intervalo de fechas seleccionado. A lo largo de esta secci&#xf3;n se muestra c&#xf3;mo realizar su creaci&#xf3;n, dise&#xf1;o y posterior visualizaci&#xf3;n a trav&#xe9;s de IDbox.</p><hr /></section><section>
<h2><a name="a2._Creaci.C3.B3n_de_informes"></a><a name="report-creation"></a>2. Creaci&#xf3;n de informes</h2>
<p>La creaci&#xf3;n de informe permite generar un documento almacenado en IDbox que posteriormente puede ser visualizado o editado.</p><section>
<h3><a name="a2.1_Configuraci.C3.B3n_inicial"></a><a name="report-creation-init"></a>2.1 Configuraci&#xf3;n inicial</h3>
<p>Para comenzar la creaci&#xf3;n de un informe existen dos m&#xe9;todos de acceso que a continuaci&#xf3;n se describen.</p><section>
<h4><a name="a2.1.1_Comienzo_r.C3.A1pido"></a><a name="report-creation-init-quickstart"></a>2.1.1 Comienzo r&#xe1;pido</h4>
<p>Si ya tenemos el conjunto de se&#xf1;ales deseado previamente seleccionado en la herramienta &#x201c;Selecci&#xf3;n de se&#xf1;ales&#x201d;, utilizar esta opci&#xf3;n es la forma m&#xe1;s sencilla de crear un informe. Como se muestra en la siguiente imagen, tan solo es necesario acceder a la selecci&#xf3;n desde la barra superior de la web, ajustar el intervalo de fechas deseado y hacer clic sobre el bot&#xf3;n &#x201c;Informes&#x201d;.</p>
<p><img src="images/signal_selection_reports.jpg" class="mediano" alt="Creación de informe con selección de señales" title="Creación de informe con selección de señales" /></p></section><section>
<h4><a name="a2.1.2_Asistente_de_personalizaci.C3.B3n"></a><a name="report-creation-init-wizard"></a>2.1.2 Asistente de personalizaci&#xf3;n</h4>
<p>Si se desea contar una mayor personalizaci&#xf3;n, el asistente de creaci&#xf3;n de informe permite introducir una configuraci&#xf3;n m&#xe1;s espec&#xed;fica de manera guiada. Para ello, debe accederse al apartado de informes tal y como se visualiza en la imagen que se muestra a continuaci&#xf3;n. Si ya hubiera alg&#xfa;n informe abierto ser&#xed;a necesario pulsar adem&#xe1;s sobre &#x201c;Nuevo informe&#x201d;.</p>
<p><img src="images/reports_shortcut.jpg" class="mediano" alt="Apertura de informes desde el menú superior" title="Apertura de informes desde el menú superior" /></p>
<p>Como se observa en la siguiente imagen, el asistente de creaci&#xf3;n de informes permite navegar a lo largo de tres pasos, que se describen a continuaci&#xf3;n, para completar la configuraci&#xf3;n.</p>
<p><img src="images/report_wizard.png" class="grande" alt="Asistente de creación de informe" title="Asistente de creación de informe" /></p>
<ol style="list-style-type: decimal">

<li><b>Tipo de informe</b>: permite seleccionar un informe personalizado que haya sido implementado y cargado anteriormente. El tipo de informe por defecto se encuentra siempre disponible e incluye como fuentes de datos la informaci&#xf3;n de se&#xf1;al(es) e hist&#xf3;rico(s) as&#xed; como los par&#xe1;metros de &#x201c;fecha inicio&#x201d; y &#x201c;fecha fin&#x201d;.</li>
<li><b>Se&#xf1;ales</b>: en este punto es posible incluir las se&#xf1;ales deseadas en el nuevo informe mediante el selector de se&#xf1;ales.</li>
<li><b>Configuraci&#xf3;n del informe</b>: permite seleccionar la marca de datos para el documento as&#xed; como la configuraci&#xf3;n de interpolaci&#xf3;n, estad&#xed;stico y unidades para cada se&#xf1;al.</li>
<li><b>Fechas</b>: a trav&#xe9;s del selector de fechas es posible definir el intervalo temporal sobre el que estar&#xe1; basado el informe, bien proporcionando un rango fijo que se mantiene permanentemente o din&#xe1;mico que se recalcula para cada apertura del informe.</li>
</ol></section></section><section>
<h3><a name="a2.2_Guardado_de_documento"></a><a name="report-creation-save"></a>2.2 Guardado de documento</h3>
<p>Una vez configurado el informe con uno de los dos m&#xe9;todos presentados anteriormente, la creaci&#xf3;n termina con el guardado del documento. Para ello es necesario introducir un nombre, y opcionalmente la ubicaci&#xf3;n, en el di&#xe1;logo que a continuaci&#xf3;n se muestra.</p>
<p><img src="images/save_report.png" class="grande" alt="Guardado de informe" title="Guardado de informe" /></p><hr /></section></section><section>
<h2><a name="a3._Visualizaci.C3.B3n_de_informes"></a><a name="report-viewer"></a>3. Visualizaci&#xf3;n de informes</h2>
<p>Aquellos documentos que hayan sido guardados pueden ser accedidos posteriormente desde el explorador de IDbox. Una vez localizado, es suficiente con hacer clic sobre el documento o hacer clic sobre la acci&#xf3;n &#x201c;Abrir&#x201d;.</p>
<p><img src="images/open_report.jpg" class="mediano" alt="Apertura de informe" title="Apertura de informe" /></p>
<p>Tras esta acci&#xf3;n, la visualizaci&#xf3;n del informe se mostrar&#xe1; en pantalla observando las distintas partes que se muestran en la imagen y se describen seguidamente.</p>
<p><img src="images/report_viewer.png" class="grande" alt="Visor de informe" title="Visor de informe" /></p>
<ol style="list-style-type: decimal">

<li><b>Acciones</b>: permite consultar el t&#xed;tulo del informe, y hacer uso de distintas operaciones: generar enlace, abrir documento, descargar y exportar informe, imprimir informe, refrescar informe, fijar como p&#xe1;gna de inicio, acceder a la documentacion, crear una suscripci&#xf3;n, pantalla completa, extraer pantalla y cierre del documento.</li>
<li><b>Herramientas</b>: permite modificar los valores del intervalo de fechas (inicio y fin), importar una versi&#xf3;n actualizada del dise&#xf1;o del informe o realizar una b&#xfa;squeda.</li>
<li><b>Visor</b>: ofrece una vista del informe renderizado seg&#xfa;n el dise&#xf1;o guardado anteriormente.</li>
</ol><hr /></section><section>
<h2><a name="a4._Dise.C3.B1o_de_informes"></a><a name="report-designer"></a>4. Dise&#xf1;o de informes</h2>
<p>El dise&#xf1;ador permite personalizar el documento de informe a&#xf1;adiendo, eliminando o modificando los distintos componentes disponibles sobre el lienzo. El fichero fuente, exportable desde la visualizaci&#xf3;n, sigue la definici&#xf3;n RDL/RDLC siendo compatible con los siguientes editores:</p>
<ul>

<li><b>Bold Reports Standalone Designer</b>: Editor gratuito distribuido por Bold Reports (Syncfusion). Compatibles versiones menores o iguales a 3.1.43. <a class="externalLink" href="https://www.boldreports.com/standalone-report-designer">&gt;&gt; Disponible en sitio web de Bold Reports</a></li>
<li><b>Microsoft RDLC Report Designer</b>: Editor gratuito distribuido por Microsoft. <a class="externalLink" href="https://www.microsoft.com/es-es/download/details.aspx?id=53613">&gt;&gt; Disponible en centro de descargas de Microsoft</a></li>
</ul>
<p>Aunque el uso de cada dise&#xf1;ador puede variar, generalmente se identifican las siguientes &#xe1;reas que se muestran en la siguiente imagen y describen a continuaci&#xf3;n.</p>
<p><img src="images/report_designer.png" class="grande" alt="Editor de informe" title="Editor de informe" /></p>
<ol style="list-style-type: decimal">

<li><b>Acciones</b>: a lo largo de este panel es posible aplicar distintas operaciones como deshacer, rehacer, guardar, abrir documento, previsualizar informe o ajustes de visualizaci&#xf3;n.</li>
<li><b>Componentes</b>: se encuentran todos los componentes disponibles para incluir en el informe, cuyas instrucciones de uso se describen en la documentaci&#xf3;n de cada editor.</li>
<li><b>Lienzo</b>: se divide en varias secciones a las que es posible arrastrar los componentes disponibles. Una vez a&#xf1;adidos al lienzo pueden desplazarse para crear la distribuci&#xf3;n y dise&#xf1;o deseado.</li>
<li><b>Propiedades</b>: cada uno de los elementos seleccionados desde el lienzo cuentan con una serie de propiedades que pueden ajustarse en el panel derecho para modificar sus estilos, comportamiento o nomenclatura.</li>
</ol></section>

			</div>
		</div>
    
		<div id="myModal" class="modal">
  			<span class="close" onclick="document.getElementById('myModal').style.display='none'">&times;</span>
  			<img class="modal-content" id="img01">
  		<div id="caption"></div>
	</div>

		<script>
			// Get the modal
			var modal = document.getElementById('myModal');
			
			var modalImg = document.getElementById("img01");
			var captionText = document.getElementById("caption");
	
			// buscamos todas las imagenes
			var imgs = document.getElementsByTagName('img');
			for(var i = 0; i < imgs.length;i++)
			{
				  // por cada imagen le asignamos el evento clic que mostrara la imagen en la modal
				  var img = imgs[i];
				  img.onclick = function()
				  {
				      modal.style.display = "block";
				      modalImg.src = this.src;
				      captionText.innerHTML = this.alt;
				  }
			}
	
	
	 
			var span = document.getElementsByClassName("close")[0];
			 
			 
			span.onclick = function() 
			{
			  	modal.style.display = "none";
			}
		
		</script>

  </body>

   <footer>
   
        <div class="container">

            <hr class="detalle">
            <div class="row">
                <div class="col-md-12 footer">
                    <div class="datos">
                        <p>DOCUMENTACI&Oacute;N</p>
                        <p>Versi&#243;n 3.0</p>
                    </div>

                    <div class="copy">
                        <p>&copy;IDboxRT a CIC CONSULTING INFORM&Aacute;TICO Product</p>
                    </div>
                </div>
            </div>
        </div>
   </footer>